ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_crypto.h
/***************************************************************************//**
* \file cyip_crypto.h
*
* \brief
* CRYPTO IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_CRYPTO_H_
#define _CYIP_CRYPTO_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */

#define CRYPTO_SECTION_SIZE         0x00010000UL

/**
  * \brief Cryptography component (CRYPTO)
  */
typedef struct {                                /*!< CRYPTO Structure                                                          */
  __IOM uint32_t CTL;                           /*!< 0x00000000 Control                                                        */
   __IM uint32_t STATUS;                        /*!< 0x00000004 Status                                                         */
   __IM uint32_t RESERVED[6];
   __IM uint32_t ERROR_STATUS0;                 /*!< 0x00000020 Error status 0                                                 */
  __IOM uint32_t ERROR_STATUS1;                 /*!< 0x00000024 Error status 1                                                 */
   __IM uint32_t RESERVED1[6];
  __IOM uint32_t INSTR_FF_CTL;                  /*!< 0x00000040 Instruction FIFO control                                       */
   __IM uint32_t INSTR_FF_STATUS;               /*!< 0x00000044 Instruction FIFO status                                        */
   __OM uint32_t INSTR_FF_WR;                   /*!< 0x00000048 Instruction FIFO write                                         */
   __IM uint32_t RESERVED2[13];
   __IM uint32_t RF_DATA[16];                   /*!< 0x00000080 Register-file                                                  */
   __IM uint32_t RESERVED3[16];
  __IOM uint32_t AES_CTL;                       /*!< 0x00000100 AES control                                                    */
   __IM uint32_t RESERVED4[31];
   __IM uint32_t STR_RESULT;                    /*!< 0x00000180 String result                                                  */
   __IM uint32_t RESERVED5[31];
  __IOM uint32_t PR_LFSR_CTL0;                  /*!< 0x00000200 Pseudo random LFSR control 0                                   */
  __IOM uint32_t PR_LFSR_CTL1;                  /*!< 0x00000204 Pseudo random LFSR control 1                                   */
  __IOM uint32_t PR_LFSR_CTL2;                  /*!< 0x00000208 Pseudo random LFSR control 2                                   */
   __IM uint32_t RESERVED6;
  __IOM uint32_t PR_RESULT;                     /*!< 0x00000210 Pseudo random result                                           */
   __IM uint32_t RESERVED7[27];
  __IOM uint32_t TR_CTL0;                       /*!< 0x00000280 True random control 0                                          */
  __IOM uint32_t TR_CTL1;                       /*!< 0x00000284 True random control 1                                          */
  __IOM uint32_t TR_RESULT;                     /*!< 0x00000288 True random result                                             */
   __IM uint32_t RESERVED8[5];
  __IOM uint32_t TR_GARO_CTL;                   /*!< 0x000002A0 True random GARO control                                       */
  __IOM uint32_t TR_FIRO_CTL;                   /*!< 0x000002A4 True random FIRO control                                       */
   __IM uint32_t RESERVED9[6];
  __IOM uint32_t TR_MON_CTL;                    /*!< 0x000002C0 True random monitor control                                    */
   __IM uint32_t RESERVED10;
  __IOM uint32_t TR_MON_CMD;                    /*!< 0x000002C8 True random monitor command                                    */
   __IM uint32_t RESERVED11;
  __IOM uint32_t TR_MON_RC_CTL;                 /*!< 0x000002D0 True random monitor RC control                                 */
   __IM uint32_t RESERVED12;
   __IM uint32_t TR_MON_RC_STATUS0;             /*!< 0x000002D8 True random monitor RC status 0                                */
   __IM uint32_t TR_MON_RC_STATUS1;             /*!< 0x000002DC True random monitor RC status 1                                */
  __IOM uint32_t TR_MON_AP_CTL;                 /*!< 0x000002E0 True random monitor AP control                                 */
   __IM uint32_t RESERVED13;
   __IM uint32_t TR_MON_AP_STATUS0;             /*!< 0x000002E8 True random monitor AP status 0                                */
   __IM uint32_t TR_MON_AP_STATUS1;             /*!< 0x000002EC True random monitor AP status 1                                */
   __IM uint32_t RESERVED14[4];
  __IOM uint32_t SHA_CTL;                       /*!< 0x00000300 SHA control                                                    */
   __IM uint32_t RESERVED15[63];
  __IOM uint32_t CRC_CTL;                       /*!< 0x00000400 CRC control                                                    */
   __IM uint32_t RESERVED16[3];
  __IOM uint32_t CRC_DATA_CTL;                  /*!< 0x00000410 CRC data control                                               */
   __IM uint32_t RESERVED17[3];
  __IOM uint32_t CRC_POL_CTL;                   /*!< 0x00000420 CRC polynomial control                                         */
   __IM uint32_t RESERVED18[3];
  __IOM uint32_t CRC_LFSR_CTL;                  /*!< 0x00000430 CRC LFSR control                                               */
   __IM uint32_t RESERVED19[3];
  __IOM uint32_t CRC_REM_CTL;                   /*!< 0x00000440 CRC remainder control                                          */
   __IM uint32_t RESERVED20;
   __IM uint32_t CRC_REM_RESULT;                /*!< 0x00000448 CRC remainder result                                           */
   __IM uint32_t RESERVED21[13];
  __IOM uint32_t VU_CTL0;                       /*!< 0x00000480 Vector unit control 0                                          */
  __IOM uint32_t VU_CTL1;                       /*!< 0x00000484 Vector unit control 1                                          */
   __IM uint32_t RESERVED22[2];
   __IM uint32_t VU_STATUS;                     /*!< 0x00000490 Vector unit status                                             */
   __IM uint32_t RESERVED23[203];
  __IOM uint32_t INTR;                          /*!< 0x000007C0 Interrupt register                                             */
  __IOM uint32_t INTR_SET;                      /*!< 0x000007C4 Interrupt set register                                         */
  __IOM uint32_t INTR_MASK;                     /*!< 0x000007C8 Interrupt mask register                                        */
   __IM uint32_t INTR_MASKED;                   /*!< 0x000007CC Interrupt masked register                                      */
   __IM uint32_t RESERVED24[3596];
  __IOM uint32_t MEM_BUFF[4096];                /*!< 0x00004000 Memory buffer                                                  */
} CRYPTO_Type;                                  /*!< Size = 32768 (0x8000)                                                     */


