ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_crypto.h
#define CRYPTO_INTR_TR_INITIALIZED_Pos    (2UL)                 /*!< CRYPTO INTR: TR_INITIALIZED (Bit 2)                       */
#define CRYPTO_INTR_TR_INITIALIZED_Msk    (0x4UL)               /*!< CRYPTO INTR: TR_INITIALIZED (Bitfield-Mask: 0x01)         */
#define CRYPTO_INTR_TR_DATA_AVAILABLE_Pos (3UL)                 /*!< CRYPTO INTR: TR_DATA_AVAILABLE (Bit 3)                    */
#define CRYPTO_INTR_TR_DATA_AVAILABLE_Msk (0x8UL)               /*!< CRYPTO INTR: TR_DATA_AVAILABLE (Bitfield-Mask: 0x01)      */
#define CRYPTO_INTR_PR_DATA_AVAILABLE_Pos (4UL)                 /*!< CRYPTO INTR: PR_DATA_AVAILABLE (Bit 4)                    */
#define CRYPTO_INTR_PR_DATA_AVAILABLE_Msk (0x10UL)              /*!< CRYPTO INTR: PR_DATA_AVAILABLE (Bitfield-Mask: 0x01)      */
#define CRYPTO_INTR_INSTR_OPC_ERROR_Pos   (16UL)                /*!< CRYPTO INTR: INSTR_OPC_ERROR (Bit 16)                     */
#define CRYPTO_INTR_INSTR_OPC_ERROR_Msk   (0x10000UL)           /*!< CRYPTO INTR: INSTR_OPC_ERROR (Bitfield-Mask: 0x01)        */
#define CRYPTO_INTR_INSTR_CC_ERROR_Pos    (17UL)                /*!< CRYPTO INTR: INSTR_CC_ERROR (Bit 17)                      */
#define CRYPTO_INTR_INSTR_CC_ERROR_Msk    (0x20000UL)           /*!< CRYPTO INTR: INSTR_CC_ERROR (Bitfield-Mask: 0x01)         */
#define CRYPTO_INTR_BUS_ERROR_Pos         (18UL)                /*!< CRYPTO INTR: BUS_ERROR (Bit 18)                           */
#define CRYPTO_INTR_BUS_ERROR_Msk         (0x40000UL)           /*!< CRYPTO INTR: BUS_ERROR (Bitfield-Mask: 0x01)              */
#define CRYPTO_INTR_TR_AP_DETECT_ERROR_Pos (19UL)               /*!< CRYPTO INTR: TR_AP_DETECT_ERROR (Bit 19)                  */
#define CRYPTO_INTR_TR_AP_DETECT_ERROR_Msk (0x80000UL)          /*!< CRYPTO INTR: TR_AP_DETECT_ERROR (Bitfield-Mask: 0x01)     */
#define CRYPTO_INTR_TR_RC_DETECT_ERROR_Pos (20UL)               /*!< CRYPTO INTR: TR_RC_DETECT_ERROR (Bit 20)                  */
#define CRYPTO_INTR_TR_RC_DETECT_ERROR_Msk (0x100000UL)         /*!< CRYPTO INTR: TR_RC_DETECT_ERROR (Bitfield-Mask: 0x01)     */
/* ====================================================  CRYPTO.INTR_SET  ==================================================== */
#define CRYPTO_INTR_SET_INSTR_FF_LEVEL_Pos (0UL)                /*!< CRYPTO INTR_SET: INSTR_FF_LEVEL (Bit 0)                   */
#define CRYPTO_INTR_SET_INSTR_FF_LEVEL_Msk (0x1UL)              /*!< CRYPTO INTR_SET: INSTR_FF_LEVEL (Bitfield-Mask: 0x01)     */
#define CRYPTO_INTR_SET_INSTR_FF_OVERFLOW_Pos (1UL)             /*!< CRYPTO INTR_SET: INSTR_FF_OVERFLOW (Bit 1)                */
#define CRYPTO_INTR_SET_INSTR_FF_OVERFLOW_Msk (0x2UL)           /*!< CRYPTO INTR_SET: INSTR_FF_OVERFLOW (Bitfield-Mask: 0x01)  */
#define CRYPTO_INTR_SET_TR_INITIALIZED_Pos (2UL)                /*!< CRYPTO INTR_SET: TR_INITIALIZED (Bit 2)                   */
#define CRYPTO_INTR_SET_TR_INITIALIZED_Msk (0x4UL)              /*!< CRYPTO INTR_SET: TR_INITIALIZED (Bitfield-Mask: 0x01)     */
#define CRYPTO_INTR_SET_TR_DATA_AVAILABLE_Pos (3UL)             /*!< CRYPTO INTR_SET: TR_DATA_AVAILABLE (Bit 3)                */
#define CRYPTO_INTR_SET_TR_DATA_AVAILABLE_Msk (0x8UL)           /*!< CRYPTO INTR_SET: TR_DATA_AVAILABLE (Bitfield-Mask: 0x01)  */
#define CRYPTO_INTR_SET_PR_DATA_AVAILABLE_Pos (4UL)             /*!< CRYPTO INTR_SET: PR_DATA_AVAILABLE (Bit 4)                */
#define CRYPTO_INTR_SET_PR_DATA_AVAILABLE_Msk (0x10UL)          /*!< CRYPTO INTR_SET: PR_DATA_AVAILABLE (Bitfield-Mask: 0x01)  */
#define CRYPTO_INTR_SET_INSTR_OPC_ERROR_Pos (16UL)              /*!< CRYPTO INTR_SET: INSTR_OPC_ERROR (Bit 16)                 */
#define CRYPTO_INTR_SET_INSTR_OPC_ERROR_Msk (0x10000UL)         /*!< CRYPTO INTR_SET: INSTR_OPC_ERROR (Bitfield-Mask: 0x01)    */
#define CRYPTO_INTR_SET_INSTR_CC_ERROR_Pos (17UL)               /*!< CRYPTO INTR_SET: INSTR_CC_ERROR (Bit 17)                  */
#define CRYPTO_INTR_SET_INSTR_CC_ERROR_Msk (0x20000UL)          /*!< CRYPTO INTR_SET: INSTR_CC_ERROR (Bitfield-Mask: 0x01)     */
#define CRYPTO_INTR_SET_BUS_ERROR_Pos     (18UL)                /*!< CRYPTO INTR_SET: BUS_ERROR (Bit 18)                       */
#define CRYPTO_INTR_SET_BUS_ERROR_Msk     (0x40000UL)           /*!< CRYPTO INTR_SET: BUS_ERROR (Bitfield-Mask: 0x01)          */
#define CRYPTO_INTR_SET_TR_AP_DETECT_ERROR_Pos (19UL)           /*!< CRYPTO INTR_SET: TR_AP_DETECT_ERROR (Bit 19)              */
#define CRYPTO_INTR_SET_TR_AP_DETECT_ERROR_Msk (0x80000UL)      /*!< CRYPTO INTR_SET: TR_AP_DETECT_ERROR (Bitfield-Mask: 0x01) */
#define CRYPTO_INTR_SET_TR_RC_DETECT_ERROR_Pos (20UL)           /*!< CRYPTO INTR_SET: TR_RC_DETECT_ERROR (Bit 20)              */
#define CRYPTO_INTR_SET_TR_RC_DETECT_ERROR_Msk (0x100000UL)     /*!< CRYPTO INTR_SET: TR_RC_DETECT_ERROR (Bitfield-Mask: 0x01) */
/* ===================================================  CRYPTO.INTR_MASK  ==================================================== */
#define CRYPTO_INTR_MASK_INSTR_FF_LEVEL_Pos (0UL)               /*!< CRYPTO INTR_MASK: INSTR_FF_LEVEL (Bit 0)                  */
#define CRYPTO_INTR_MASK_INSTR_FF_LEVEL_Msk (0x1UL)             /*!< CRYPTO INTR_MASK: INSTR_FF_LEVEL (Bitfield-Mask: 0x01)    */
#define CRYPTO_INTR_MASK_INSTR_FF_OVERFLOW_Pos (1UL)            /*!< CRYPTO INTR_MASK: INSTR_FF_OVERFLOW (Bit 1)               */
#define CRYPTO_INTR_MASK_INSTR_FF_OVERFLOW_Msk (0x2UL)          /*!< CRYPTO INTR_MASK: INSTR_FF_OVERFLOW (Bitfield-Mask: 0x01) */
#define CRYPTO_INTR_MASK_TR_INITIALIZED_Pos (2UL)               /*!< CRYPTO INTR_MASK: TR_INITIALIZED (Bit 2)                  */
#define CRYPTO_INTR_MASK_TR_INITIALIZED_Msk (0x4UL)             /*!< CRYPTO INTR_MASK: TR_INITIALIZED (Bitfield-Mask: 0x01)    */
#define CRYPTO_INTR_MASK_TR_DATA_AVAILABLE_Pos (3UL)            /*!< CRYPTO INTR_MASK: TR_DATA_AVAILABLE (Bit 3)               */
#define CRYPTO_INTR_MASK_TR_DATA_AVAILABLE_Msk (0x8UL)          /*!< CRYPTO INTR_MASK: TR_DATA_AVAILABLE (Bitfield-Mask: 0x01) */
#define CRYPTO_INTR_MASK_PR_DATA_AVAILABLE_Pos (4UL)            /*!< CRYPTO INTR_MASK: PR_DATA_AVAILABLE (Bit 4)               */
#define CRYPTO_INTR_MASK_PR_DATA_AVAILABLE_Msk (0x10UL)         /*!< CRYPTO INTR_MASK: PR_DATA_AVAILABLE (Bitfield-Mask: 0x01) */
#define CRYPTO_INTR_MASK_INSTR_OPC_ERROR_Pos (16UL)             /*!< CRYPTO INTR_MASK: INSTR_OPC_ERROR (Bit 16)                */
#define CRYPTO_INTR_MASK_INSTR_OPC_ERROR_Msk (0x10000UL)        /*!< CRYPTO INTR_MASK: INSTR_OPC_ERROR (Bitfield-Mask: 0x01)   */
#define CRYPTO_INTR_MASK_INSTR_CC_ERROR_Pos (17UL)              /*!< CRYPTO INTR_MASK: INSTR_CC_ERROR (Bit 17)                 */
#define CRYPTO_INTR_MASK_INSTR_CC_ERROR_Msk (0x20000UL)         /*!< CRYPTO INTR_MASK: INSTR_CC_ERROR (Bitfield-Mask: 0x01)    */
#define CRYPTO_INTR_MASK_BUS_ERROR_Pos    (18UL)                /*!< CRYPTO INTR_MASK: BUS_ERROR (Bit 18)                      */
#define CRYPTO_INTR_MASK_BUS_ERROR_Msk    (0x40000UL)           /*!< CRYPTO INTR_MASK: BUS_ERROR (Bitfield-Mask: 0x01)         */
#define CRYPTO_INTR_MASK_TR_AP_DETECT_ERROR_Pos (19UL)          /*!< CRYPTO INTR_MASK: TR_AP_DETECT_ERROR (Bit 19)             */
#define CRYPTO_INTR_MASK_TR_AP_DETECT_ERROR_Msk (0x80000UL)     /*!< CRYPTO INTR_MASK: TR_AP_DETECT_ERROR (Bitfield-Mask: 0x01)*/
#define CRYPTO_INTR_MASK_TR_RC_DETECT_ERROR_Pos (20UL)          /*!< CRYPTO INTR_MASK: TR_RC_DETECT_ERROR (Bit 20)             */
#define CRYPTO_INTR_MASK_TR_RC_DETECT_ERROR_Msk (0x100000UL)    /*!< CRYPTO INTR_MASK: TR_RC_DETECT_ERROR (Bitfield-Mask: 0x01)*/
/* ==================================================  CRYPTO.INTR_MASKED  =================================================== */
#define CRYPTO_INTR_MASKED_INSTR_FF_LEVEL_Pos (0UL)             /*!< CRYPTO INTR_MASKED: INSTR_FF_LEVEL (Bit 0)                */
#define CRYPTO_INTR_MASKED_INSTR_FF_LEVEL_Msk (0x1UL)           /*!< CRYPTO INTR_MASKED: INSTR_FF_LEVEL (Bitfield-Mask: 0x01)  */
#define CRYPTO_INTR_MASKED_INSTR_FF_OVERFLOW_Pos (1UL)          /*!< CRYPTO INTR_MASKED: INSTR_FF_OVERFLOW (Bit 1)             */
#define CRYPTO_INTR_MASKED_INSTR_FF_OVERFLOW_Msk (0x2UL)        /*!< CRYPTO INTR_MASKED: INSTR_FF_OVERFLOW (Bitfield-Mask: 0x01)*/
#define CRYPTO_INTR_MASKED_TR_INITIALIZED_Pos (2UL)             /*!< CRYPTO INTR_MASKED: TR_INITIALIZED (Bit 2)                */
#define CRYPTO_INTR_MASKED_TR_INITIALIZED_Msk (0x4UL)           /*!< CRYPTO INTR_MASKED: TR_INITIALIZED (Bitfield-Mask: 0x01)  */
#define CRYPTO_INTR_MASKED_TR_DATA_AVAILABLE_Pos (3UL)          /*!< CRYPTO INTR_MASKED: TR_DATA_AVAILABLE (Bit 3)             */
#define CRYPTO_INTR_MASKED_TR_DATA_AVAILABLE_Msk (0x8UL)        /*!< CRYPTO INTR_MASKED: TR_DATA_AVAILABLE (Bitfield-Mask: 0x01)*/
#define CRYPTO_INTR_MASKED_PR_DATA_AVAILABLE_Pos (4UL)          /*!< CRYPTO INTR_MASKED: PR_DATA_AVAILABLE (Bit 4)             */
#define CRYPTO_INTR_MASKED_PR_DATA_AVAILABLE_Msk (0x10UL)       /*!< CRYPTO INTR_MASKED: PR_DATA_AVAILABLE (Bitfield-Mask: 0x01)*/
#define CRYPTO_INTR_MASKED_INSTR_OPC_ERROR_Pos (16UL)           /*!< CRYPTO INTR_MASKED: INSTR_OPC_ERROR (Bit 16)              */
#define CRYPTO_INTR_MASKED_INSTR_OPC_ERROR_Msk (0x10000UL)      /*!< CRYPTO INTR_MASKED: INSTR_OPC_ERROR (Bitfield-Mask: 0x01) */
#define CRYPTO_INTR_MASKED_INSTR_CC_ERROR_Pos (17UL)            /*!< CRYPTO INTR_MASKED: INSTR_CC_ERROR (Bit 17)               */
#define CRYPTO_INTR_MASKED_INSTR_CC_ERROR_Msk (0x20000UL)       /*!< CRYPTO INTR_MASKED: INSTR_CC_ERROR (Bitfield-Mask: 0x01)  */
#define CRYPTO_INTR_MASKED_BUS_ERROR_Pos  (18UL)                /*!< CRYPTO INTR_MASKED: BUS_ERROR (Bit 18)                    */
#define CRYPTO_INTR_MASKED_BUS_ERROR_Msk  (0x40000UL)           /*!< CRYPTO INTR_MASKED: BUS_ERROR (Bitfield-Mask: 0x01)       */
#define CRYPTO_INTR_MASKED_TR_AP_DETECT_ERROR_Pos (19UL)        /*!< CRYPTO INTR_MASKED: TR_AP_DETECT_ERROR (Bit 19)           */
#define CRYPTO_INTR_MASKED_TR_AP_DETECT_ERROR_Msk (0x80000UL)   /*!< CRYPTO INTR_MASKED: TR_AP_DETECT_ERROR (Bitfield-Mask: 0x01)*/
#define CRYPTO_INTR_MASKED_TR_RC_DETECT_ERROR_Pos (20UL)        /*!< CRYPTO INTR_MASKED: TR_RC_DETECT_ERROR (Bit 20)           */
#define CRYPTO_INTR_MASKED_TR_RC_DETECT_ERROR_Msk (0x100000UL)  /*!< CRYPTO INTR_MASKED: TR_RC_DETECT_ERROR (Bitfield-Mask: 0x01)*/
/* ====================================================  CRYPTO.MEM_BUFF  ==================================================== */
#define CRYPTO_MEM_BUFF_DATA32_Pos        (0UL)                 /*!< CRYPTO MEM_BUFF: DATA32 (Bit 0)                           */
#define CRYPTO_MEM_BUFF_DATA32_Msk        (0xffffffffUL)        /*!< CRYPTO MEM_BUFF: DATA32 (Bitfield-Mask: 0xffffffff)       */


#endif /* _CYIP_CRYPTO_H_ */


/* [] END OF FILE */
